# Primeiros códigos para extração de dados.

Iniciando o curso de introdução ao Data Science do @meigarom.lopes, "Python do 0 ao DS", na comunidade DS.

Estarei apresentando aqui os conceitos de extração, tratamento, manipulação e análise de dados, que estarei aprendendo ao longo do curso. E conforme eu esteja adquirindo conhecimento, irei começar a trazer analises de cases reais.

Começando demonstrando a minha resolução dos exercicios práticos da aula 03 do curso. Exercicio encontrado no Kaggle (https://www.kaggle.com/datasets/harlfoxem/housesalesprediction), que é uma base de dados, referente a casas que estão à venda em Seatle, nos Estados Unidos. E sobre esse case, iremos responder algumas perguntas de negócios.
(OBS: As colunas que constam um código com "#", existem por que foram exercicios aos quais eu resolvi de maneira diferente a qual o professor Meigarom resolveu, então deixei meu código e o dele para entender melhor :) )

In [48]:
import pandas as pd # Importando a biblioteca que será usada nestes exercicios e definindo o apelido.

In [49]:
data = pd.read_csv('C:\\Users\\savio\\anaconda3\\Jupyter\\kc_house_data.csv') # Localizando a base de dados e atribuindo ao objeto "data"

# 1- CRIE UMA NOVA COLUNA CHAMADA "HOUSE_AGE"
    SE O VALOR DA COLUNA DATE FOR <(MAIOR) QUE 2014-01-01 -> "NEW_HOUSE"
    SE O VALOR DA COLUNA DATE FOR >(MENOR) QUE 2014-01-01 -> "OLD_HOUSE".

In [50]:
#data ['house_age'] = 'standard' # criando a nova coluna
#data['date'] = pd.to_datetime(data['date']) # transformando a coluna 'date' no formato de data
#data.loc[data['date'] > '2014-01-01', 'house_age'] = 'new_house' # classificando as datas
#data.loc[data['date'] < '2014-01-01', 'house_age'] = 'old_house' # classificando as datas
#print(data[['id','price','date','house_age']].head()) # validando se a criação + classificação deu certo
#report = data[['id','price','date','house_age']].sort_values('date', ascending=True) # filtrando colunas desejadas para exportar para .csv
#print(report)
#report.to_csv('D:\\repositorio\\datasets\\report_house_age.csv') # exportando para excel (.csv) as informações filtradas.

In [51]:
data['date'] = pd.to_datetime(data['date'], format='%Y-%m-%d')
data['house_age'] = data['date'].apply( lambda x: 'new_house' if x > pd.to_datetime ('2014-01-01', format= '%Y-%m-%d') else 'old_house')

In [52]:
report = data[['id','price','date','house_age']]
print(report.sort_values('date', ascending = True))

               id      price       date  house_age
16768  5561000190   437500.0 2014-05-02  new_house
9596    472000620   790000.0 2014-05-02  new_house
9587   1024069009   675000.0 2014-05-02  new_house
20602  7853361370   555000.0 2014-05-02  new_house
11577  5056500260   440000.0 2014-05-02  new_house
...           ...        ...        ...        ...
7898   1422700040   183000.0 2015-05-14  new_house
928    8730000270   359000.0 2015-05-14  new_house
5637   7923600250   450000.0 2015-05-15  new_house
13053  5101400871   445500.0 2015-05-24  new_house
16594  9106000005  1310000.0 2015-05-27  new_house

[21613 rows x 4 columns]

# 2- CRIE UMA NOVA COLUNA CHAMADA: 'DORMITORY_TYPE" 
    SE O VALOR DA COLUNA 'BEDROOMS' FOR < (MENOR) QUE 1 -> 'ROOM'
    SE O VALOR DA COLUNA 'BEDROOMS' FOR == (IGUAL) A 1 -> 'STUDIO'
    SE O VALOR DA COLUNA 'BEDROOMS' FOR == (IGUAL) A 2 -> 'APARTAMENT'
    SE O VALOR DA COLUNA 'BEDROOMS' FOR MAIOR > (MAIOR) QUE 2 -> 'HOUSE'

In [53]:
#data['dormitory_type'] = 'standard'
#data.loc[data['bedrooms'] < 1, 'dormitory_type'] = 'room'
#data.loc[data['bedrooms'] == 1, 'dormitory_type'] = 'studio'
#data.loc[data['bedrooms'] == 2, 'dormitory_type'] = 'apartment'
#data.loc[data['bedrooms'] > 2, 'dormitory_type'] = 'house'
#print(data[['id','price','bedrooms','dormitory_type']].head())
#report = data[['id','price','bedrooms','dormitory_type']].sort_values('bedrooms', ascending=True)
#print(report)
#report.to_csv('D:\\repositorio\\datasets\\report_dormitory_type.csv')

In [54]:
data['dormitory_type'] = data['bedrooms'].apply( lambda x: 'studio' if x == 1 else 'apartment' if x == 2 else 
                                                    'house' if x > 2 else 'NA')

In [55]:
print(data[['id','price','bedrooms','dormitory_type']].head())

           id     price  bedrooms dormitory_type
0  7129300520  221900.0         3          house
1  6414100192  538000.0         3          house
2  5631500400  180000.0         2      apartment
3  2487200875  604000.0         4          house
4  1954400510  510000.0         3          house

# 3- CRIE UMA NOVA COLUNA CHAMADO ' CONDITION_TYPE'
    SE O VAOR DA COLUNA 'CONDITION' FOR MENOR OU IGUAL A 2 -> 'BAD'
    SE O VALOR DA COLUNA 'CONDITION' FOR IGUAL A 3 OU 4 -> 'REGULAR'
    SE O VALOR DA COLUNA 'CONDITION' FOR IGUAL A 5 -> 'GOOD'

In [56]:
#data['condition_type'] = 'standard'
#data.loc[data['condition'] <= 2, 'condition_type'] = 'bad'
#data.loc[data['condition'] == 3, 'condition_type'] = 'regular'
#data.loc[data['condition'] == 4, 'condition_type'] = 'regular'
#data.loc[data['condition'] == 5, 'condition_type'] = 'good'
#print(data[['id','condition','condition_type']].head)
#print(data.loc[data['condition'] == 4, ['id','condition','condition_type']].shape) # print para teste de condição
#print(data.loc[data['condition'] == 3, ['id','condition','condition_type']].shape) # print para teste de condição
#report = data[['id','price','condition','condition_type']]
#print(report)
#report.to_csv('D:\\repositorio\\datasets\\condition_type.csv')

In [57]:
data['condition_type'] = data['condition'].apply( lambda x: 'bad' if x <= 2 else
                                                            'regular' if (x == 3) | (x == 4) else 'good' )

In [58]:
print(data[['id','price','condition','condition_type']].head())

           id     price  condition condition_type
0  7129300520  221900.0          3        regular
1  6414100192  538000.0          3        regular
2  5631500400  180000.0          3        regular
3  2487200875  604000.0          5           good
4  1954400510  510000.0          3        regular

# 4- MODIFIQUE O TIPO DA COLUNA 'CONDITION' PARA STRING:

In [59]:
print(data.dtypes)
data ['condition'] = data['condition'].astype(str)
print(data.dtypes)

id                         int64
date              datetime64[ns]
price                    float64
bedrooms                   int64
bathrooms                float64
sqft_living                int64
sqft_lot                   int64
floors                   float64
waterfront                 int64
view                       int64
condition                  int64
grade                      int64
sqft_above                 int64
sqft_basement              int64
yr_built                   int64
yr_renovated               int64
zipcode                    int64
lat                      float64
long                     float64
sqft_living15              int64
sqft_lot15                 int64
house_age                 object
dormitory_type            object
condition_type            object
dtype: object
id                         int64
date              datetime64[ns]
price                    float64
bedrooms                   int64
bathrooms                float64
sqft_living                int64
sqft_lot                   int64
floors                   float64
waterfront                 int64
view                       int64
condition                 object
grade                      int64
sqft_above                 int64
sqft_basement              int64
yr_built                   int64
yr_renovated               int64
zipcode                    int64
lat                      float64
long                     float64
sqft_living15              int64
sqft_lot15                 int64
house_age                 object
dormitory_type            object
condition_type            object
dtype: object

# 5- DELETE AS COLUNAS 'SQFT_LIVING15' E 'SQFT_LOT15'

In [60]:
#print(data.columns)
#remove = ['sqft_living15','sqft_lot15']
#data = data.drop(remove, axis=1)
#print(data.columns)

In [61]:
data = data.drop(['sqft_living15','sqft_lot15'], axis=1)

In [62]:
data.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'house_age', 'dormitory_type', 'condition_type'],
      dtype='object')

# 6- MODIFIQUE O TIPO DA COLUNA 'YR_BUILT' PARA 'DATE'

In [63]:
#data ['yr_built'] = pd.to_datetime(data['yr_built'])
#print(data[['yr_built']].dtypes)

In [64]:
pd.to_datetime(data['yr_built'], format='%Y')

0       1955-01-01
1       1951-01-01
2       1933-01-01
3       1965-01-01
4       1987-01-01
           ...
21608   2009-01-01
21609   2014-01-01
21610   2009-01-01
21611   2004-01-01
21612   2008-01-01
Name: yr_built, Length: 21613, dtype: datetime64[ns]

In [65]:
pd.to_datetime(data['yr_built'], format='%Y').dt.year

0        1955
1        1951
2        1933
3        1965
4        1987
         ...
21608    2009
21609    2014
21610    2009
21611    2004
21612    2008
Name: yr_built, Length: 21613, dtype: int64

# 7- MODIFIQUE O TIPO DA COLUNA 'YR_RENOVATED' PARA 'DATE'

In [66]:
#data ['yr_renovated'] = pd.to_datetime(data['yr_renovated'])
#print(data[['yr_renovated']].dtypes)

In [67]:
data['yr_renovated'] = data['yr_renovated'].apply(lambda x: pd.to_datetime( '1900-01-01', format='%Y-%m-%d') if x == 0 
                                                            else pd.to_datetime(x, format='%Y'))

In [68]:
print(data[['id','yr_renovated']].head())

           id yr_renovated
0  7129300520   1900-01-01
1  6414100192   1991-01-01
2  5631500400   1900-01-01
3  2487200875   1900-01-01
4  1954400510   1900-01-01

# 8- QUAL A DATA MAIS ANTIGA DE CONSTRUÇÃO DE UM IMOVEL?

In [69]:
#data['yr_built'] = pd.to_datetime(data['yr_built'], format='%Y')
#report_construction = data[['id', 'price', 'yr_built']].sort_values('yr_built', ascending=True)
#print(report_construction)

In [70]:
data['yr_built'].min()

1900

# 9- QUAL A DATA MAIS ANTIGA DE RENOVAÇÃO DE UM IMOVEL?

In [71]:
#data['yr_renovated'] = pd.to_datetime(data['yr_renovated'])
#report_renovation = data[['id', 'price', 'yr_built', 'yr_renovated']].sort_values('yr_renovated', ascending=True)
#print(report_renovation)

In [72]:
data.loc[data['yr_renovated'] > pd.to_datetime ('1900-01-01', format='%Y-%m-%d' ), 'yr_renovated'].min()

Timestamp('1934-01-01 00:00:00')

# 10- QUANTOS IMOVEIS TEM 2 ANDARES?

In [73]:
data.loc[data['floors'] == 2, 'id'].size

8241

# 11- QUANTOS IMOVEIS ESTÃO COM CONDIÇÃO IGUAL A REGULAR?

In [74]:
data.loc[data['condition_type'] == 'regular', 'id'].size

19710

# 12- QUANTOS IMOVEIS ESTAO COM A CONDIÇÃO IGUA A 'BAD'' E POSSUEM 'VISTA PARA AGUA'?

In [75]:
data.loc[(data['condition_type'] == 'bad') & (data['waterfront'] == 1), 'id'].size

2

# 13- QUANTOS IMOVEIS ESTÃO COM A CONDIÇÃO IGUALA  'GOOD' E SÃO 'NEW_HOUSE'?

In [76]:
data.loc[(data['condition_type'] == 'good') & (data['house_age'] == 'new_house'), 'id'].size

1701

# 14- QUAL O VALOR DO IMOVEL MAIS CARO DO TIPO 'STUDIO'?

In [77]:
#data.loc[data['dormitory_type'] == 'studio'].sort_values('price', ascending = False)

In [78]:
data.loc[data['dormitory_type'] == 'studio','price'].max()

1247000.0

# 15- QUANTOS IMOVEIS DO TIPO 'APARTAMENT' FORAM REFORMADOS EM 2015?

In [79]:
data.loc[(data['dormitory_type'] == 'apartment') &
         (data['yr_renovated'] == pd.to_datetime('2015-01-01', format='%Y-%m-%d')), 'id'].size

0

# 16- QUAL O MAIOR NUMERO DE QUARTOS QUE UM IMOVEL DO TIPO 'HOUSE' POSSUI?

In [80]:
data.loc[data['dormitory_type'] == 'house', 'bedrooms'].max()

33

# 17- QUANTOS IMOVEIS 'NEW_HOUSE' FORAM REFORMADOS EM 2014?

In [81]:
data.loc[(data['house_age'] == 'new_house' ) & 
         (data['yr_renovated'] == pd.to_datetime('2014-01-01', format='%Y-%m-%d')), 'id'].size

91

# 18- SELECIONE AS COLUNAS: 'ID','DATE','PRICE', 'FLOORS', 'ZIPCODE' PELO MÉTODO:
	DIRETO PELO NOME DAS COLUNAS
	PELO INDICES
	PELOS INDICES DAS LINHAS E NOME DAS COLUNAS
	INDICES BOOLEANOS.

In [82]:
#Metodo n1:
data[['id','date','price', 'floors', 'zipcode']]

               id       date     price  floors  zipcode
0      7129300520 2014-10-13  221900.0     1.0    98178
1      6414100192 2014-12-09  538000.0     2.0    98125
2      5631500400 2015-02-25  180000.0     1.0    98028
3      2487200875 2014-12-09  604000.0     1.0    98136
4      1954400510 2015-02-18  510000.0     1.0    98074
...           ...        ...       ...     ...      ...
21608   263000018 2014-05-21  360000.0     3.0    98103
21609  6600060120 2015-02-23  400000.0     2.0    98146
21610  1523300141 2014-06-23  402101.0     2.0    98144
21611   291310100 2015-01-16  400000.0     2.0    98027
21612  1523300157 2014-10-15  325000.0     2.0    98144

[21613 rows x 5 columns]

In [83]:
#Metodo n2:
data.columns
data.iloc[:,[0,1,2,7,16]]

               id       date     price  floors  zipcode
0      7129300520 2014-10-13  221900.0     1.0    98178
1      6414100192 2014-12-09  538000.0     2.0    98125
2      5631500400 2015-02-25  180000.0     1.0    98028
3      2487200875 2014-12-09  604000.0     1.0    98136
4      1954400510 2015-02-18  510000.0     1.0    98074
...           ...        ...       ...     ...      ...
21608   263000018 2014-05-21  360000.0     3.0    98103
21609  6600060120 2015-02-23  400000.0     2.0    98146
21610  1523300141 2014-06-23  402101.0     2.0    98144
21611   291310100 2015-01-16  400000.0     2.0    98027
21612  1523300157 2014-10-15  325000.0     2.0    98144

[21613 rows x 5 columns]

In [84]:
#metodo n3
data.iloc[0:10, 0:4]

           id       date      price  bedrooms
0  7129300520 2014-10-13   221900.0         3
1  6414100192 2014-12-09   538000.0         3
2  5631500400 2015-02-25   180000.0         2
3  2487200875 2014-12-09   604000.0         4
4  1954400510 2015-02-18   510000.0         3
5  7237550310 2014-05-12  1225000.0         4
6  1321400060 2014-06-27   257500.0         3
7  2008000270 2015-01-15   291850.0         3
8  2414600126 2015-04-15   229500.0         3
9  3793500160 2015-03-12   323000.0         3

In [85]:
#Metodo n4
data.columns
cols = [True,True,True,False,False,False,False,True,False,False,False,False,False,False,False,False,True,False,False,False,False,
         False]
data.iloc[:, cols]

               id       date     price  floors  zipcode
0      7129300520 2014-10-13  221900.0     1.0    98178
1      6414100192 2014-12-09  538000.0     2.0    98125
2      5631500400 2015-02-25  180000.0     1.0    98028
3      2487200875 2014-12-09  604000.0     1.0    98136
4      1954400510 2015-02-18  510000.0     1.0    98074
...           ...        ...       ...     ...      ...
21608   263000018 2014-05-21  360000.0     3.0    98103
21609  6600060120 2015-02-23  400000.0     2.0    98146
21610  1523300141 2014-06-23  402101.0     2.0    98144
21611   291310100 2015-01-16  400000.0     2.0    98027
21612  1523300157 2014-10-15  325000.0     2.0    98144

[21613 rows x 5 columns]

# 19- SALVE UM ARQUIVO.CSV COM SOMENTE AS COLUNAS DO ITEM 10 AO 17.

In [86]:
data[['house_age','dormitory_type','condition_type']].to_csv('D:\\repositorio\\datasets\\exercicio_19.csv')

# 20-MODIFIQUE A COR DOS PONTOS NO MAPA DE 'PINK' PARA 'VERDE-ESCURO'